{
  "menu": {
    "home": "Inicio",
    "about": "Sobre mí",
    "projects": "Proyectos",
    "skills": "Habilidades",
    "studies": "Estudios",
    "experience": "Experiencia"
  },
  "home": {
    "welcome": "Bienvenido a mi portafolio",
    "description": "Mi nombre es Roger, soy un ingeniero fullstack curioso que le encanta aprender cosas nuevas y construir cosas geniales."
  },
  "about": {
    "title": "Sobre mí",
    "description": "Actualmente vivo en Barcelona, España. Tengo {age} años. Estoy estudiando el ciclo formativo de grado superior en Desarrollo de Aplicaciones Multiplataforma en el instituto de La Salle.",
    "description2": "Empecé a aprender sobre desarrollo web en 2019, en el grado medio de Sistemas microinformaticos y Redes en la asignatura de \"Aplicaciones web\" donde aprendí a usar diferentes tecnologías y gestores de contenido como HTML, CSS, JavaScript, Wordpress y Moodle.",
    "description3": "Actualmente estoy mejorando mis habilidades en el desarrollo web aprendiendo tecnologías back-end como PHP, MySQL, Laravel o node. También estoy aprendiendo tecnologías front-end como React o Next.js. Para completarme, tengo algunos conocimientos sobre diseño de UX/UI.",
    "description4": "Si desea más información sobre mí, puede acceder a mi <guidelines>Linkedin</guidelines> o mi <portfolio>personal web portfolo</portfolio>.",
    "description5": "Si desea contactarme, puede enviarme un correo electrónico a <email>roger.barrero.sorribas@gmail.com</email>."
  },
  "projects": {
    "title": {
      "web": "Proyectos web",
      "javafx": "Proyectos JavaFX"
    },
    "projects1": {
      "name": "Ciudad de Barcelona",
      "description": "Este proyecto, realizado para una asigntura del grado superior de DAW en la La Salle, es una landing page informativa de la ciudad de Barcelona y cercanias. Fue realizado con HTML, CSS y JavaScript."
    },
    "projects2": {
      "name": "Calculadora de rarezas de Mr.Crypto",
      "description": "Mr.Crypto es una comunidad privada a la que solo se puede acceder a traves de un coleccionable digital. Este proyecto realizado en ract.js, es una calculadora de rarezas de los coleccionables."
    },
    "projects3": {
      "name": "Calculadora de rarezas de Bookers",
      "description": "Bookers es una comunidad privada de lectores a la que solo se puede acceder a traves de un coleccionable digital. Este proyecto realizado en next.js y tailwind, es una calculadora de rarezas de los coleccionables."
    },
    "projects4": {
      "name": "Calculadora",
      "description": "Es una calculadora preparada para realizar operaciones matemáticas básicas."
    },
    "projects5": {
      "name": "App de multiplicacion",
      "description": "Es una aplicación que te da multiplicaciones y las tienes que resolver."
    },
    "projects6": {
      "name": "Reloj digital",
      "description": "Es un reloj digital que muestra la hora actual."
    },
    "projects7": {
      "name": "Contador de caracteres",
      "description": "Es una aplicación que cuenta los caracteres de un texto a tiempo real."
    },
    "projects8": {
      "name": "Generador de colores aleatorios",
      "description": "Es una aplicación que genera colores aleatorios y te muestra su código hexadecimal."
    },
    "projects9": {
      "name": "Tiempo en tu ciudad",
      "description": "Es una aplicación que te muestra el tiempo en tu ciudad."
    },
    "projects10": {
      "name": "resultados de la liga",
      "description": "Es una aplicación que te muestra los resultados de la liga y los proximos partidos."
    },
    "projects11": {
      "name": "Cambio de moneda",
      "description": "Es una app que te muestra el cambio de moneda en tiempo real."
    },
    "projects12": {
      "name": "Vuelos con llegada a Barcelona",
      "description": "Es una APP que te muestra los vuelos que llegan a Barcelona."
    },
    "javafx1": {
      "name": "Lector de Base de Datos",
      "description": "Este proyecto, realizado para una asigntura del grado superior de DAW en la La Salle, es una aplicacion en java que te lee las bases de datos de tu servidor local y te muestra los datos."
    },
    "javafx2": {
      "name": "Juego del 7 y medio",
      "description": "Este proyecto, realizado para una asigntura del grado superior de DAW en la La Salle, es el clasico juego de cartas del 7 y medio."
    }
  },
  "skills": {
    "title": "Habilidades"
  },
  "studies": {
    "title": "Estudios",
    "year": {
      "current": "Actualidad",
      "2024": "2024",
      "2023": "2023",
      "2022": "2022",
      "2021": "2021",
      "2020": "2020",
      "2019": "2019",
      "2018": "2018",
      "2017": "2017",
      "2016": "2016",
      "2015": "2015",
      "2014": "2014",
      "2013": "2013",
      "2012": "2012",
      "2011": "2011",
      "2010": "2010"
    },
    "school": {
      "lasalleonline": "La Salle Online",
      "lasallegracia": "La Salle Gracia",
      "eugeni": "IES Eugeni d'Ors",
      "lucatic": "Luca TIC",
      "udemy": "Udemy",
      "CET": "CET 10",
      "CISCO": "CISCO"
    },
    "degree": {
      "DAM": "GFGS Desarrollo de Aplicaciones Multiplataforma",
      "DAW": "CFGS Desarrollo de Aplicaciones Web",
      "SMX": "CFGM Sistemas Microinformáticos y Redes",
      "InTalent": "Programa InTalent, Java Microservicios",
      "Solidity": "Smart Contracts con Solidity de A a Z",
      "Diamizer": "Curso de dinamizador de actividades multideportivas",
      "monitor": "Curso de monitor de ocio y tiempo libre",
      "CCNA": "Titulo en redes"
    }
  },
  "experience": {
    "title": "Experiencia",
    "year": {
      "current": "Actualidad",
      "2025": "2025",
      "2024": "2024",
      "2023": "2023",
      "2022": "2022",
      "2021": "2021",
      "2020": "2020",
      "2019": "2019",
      "2018": "2018",
      "2017": "2017",
      "2016": "2016",
      "2015": "2015",
      "2014": "2014",
      "2013": "2013",
      "2012": "2012",
      "2011": "2011",
      "2010": "2010"
    },
    "enterprice": {
      "ntt": {
        "title": "NTT Data Europe & Latam",
        "position": "Junior Frontend Developer Engineer",
        "description": "<ul><li>Naturgy (UFD) Proyecto del portal privado web</li></ul>"
      },
      "nsign": {
        "title": "NSIGN.TV",
        "position": "Trainee Frontend Engineer",
        "description": "<ul><li>Diseño y desarrollo de distintas funciones para los clientes<ul><li>Vuelos con llegada a Barcelona</li><li>Cambio Euro - Dolar en tiempo real</li><li>Visualizar los proximos partidos de La Liga</li><li>Tiempo en tu localizacion (o la que marque el navegador)</li><li>Visualizacion de los proximos eventos en tu calendario</li></ul></li><li>Analisis del UX de la plataforma y realizar distintas propuestas de mejora</li></ul>"
      },
      "aecc": {
        "title": "Asociación española contra el cáncer",
        "position": "Monitor de colonias de verano",
        "description": "<ul>Realizar diferentes tareas para dinamizar al grupo de niños del grupo de mediamos (10 - 13 años) en los Campamentos de Verano que realiza anualmente la Asociación Española Contra el Cáncer en Salardú (Vall d'aran)</ul>"
      },
      "ckm": {
        "title": "Asociación Comkedem",
        "position": "Voluntario",
        "description": "<ul><li>Diseño de las diferentes secciones del sitio web para una futura actualización en wordpress</li></ul>"
      },
      "ckm2": {
        "title": "Asociación Comkedem",
        "position": "Monitor de casal y campamento de verano",
        "description": "<ul><li>Realizar diferentes tareas de dinamización grupal en el casal deportivo (entre 8 y 15 años) y en las Estadas Autonomas (entre 16 y 18) que realiza cada verano la Asociación Comkedem</li></ul>"
      },
      "ies": {
        "title": "IES Alt Penedes",
        "position": "Tecnico Informatico",
        "description": "<ul><li>Instalación, actualización y configuración de sistemas operativos y software accesorios para portátiles recién adquiridos.</li><li>Instalación de equipos audiovisuales en las aulas.</li><li>Elaboración de audiovisuales para las jornadas de puertas abiertas del curso académico 2020-2021</li><li>Colaboración en la instalación y configuración de la plataforma Moodle para poder realizar las clases telemáticas durante la pandemia</li></ul>"
      }
    }
  }
}